Q1. How do you load a CSV file into a Pandas DataFrame?

import pandas as pd

pd.read_csv('csv filepath')

Q2. How do you check the data type of a column in a Pandas DataFrame?

To check data type of every column we can use dtype attribute . The attribute returns a series with the data type of each column. And the column names of the DataFrame are represented as the index of the resultant series object and the corresponding data types are returned as values of the series object.
 
 
import pandas as pd

df = pd.read_csv('filepath')
df.dtype

Q3. How do you select rows from a Pandas DataFrame based on a condition?

In [4]:
#we can select rows based on particular column value using '>', '=', '=', '<=', '!=' operator.
 
import pandas as pd
df = pd.DataFrame({'name':['nas','reh','muk'],
             'age':[24,22,20]
             })
#selecting row based on condition
df[df['age']>20]

  name  age
0  nas   24
1  reh   22

Q4. How do you rename columns in a Pandas DataFrame?

In [17]:
import pandas as pd

df1=pd.DataFrame({'name' :['a','b','c']
            })
df1
#here a ,b, c are coloumns names
df1.rename(columns={'name':'rename'},inplace=True)
df1
 #by using rename() function we can rename the columns

  rename
0      a
1      b
2      c

Q5. How do you drop columns in a Pandas DataFrame?

In [27]:
import pandas as pd
df = pd.DataFrame({'name':['nas','reh','muk'],
             'age':[24,22,20]
             })
df.drop(['age'], axis=1) # or del df['age']

  name
0  nas
1  reh
2  muk

Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [31]:
data = {
    'A':[1,2,3,4], 
    'B':[1,2,2,3], 
    'C':[6,7,8,6], 
    'D':[6,7,6,4], 
    }
dff= pd.DataFrame(data)
#to get unique values using unique() function
dff.B.unique()

array([1, 2, 3], dtype=int64)

Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [ ]:
we can use the following syntax to count NaN values in Pandas DataFrame:
    (1) Count NaN values under a single DataFrame column:
        df['column name'].isna().sum()
    
    (2) Count NaN values under an entire DataFrame:
        df.isna().sum().sum()
        
    (3) Count NaN values across a single DataFrame row:
        df.loc[[index value]].isna().sum().sum()

Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [ ]:
syntax:
    
dataframe.fillna(value, method, axis, inplace, limit, downcast)

example:

import pandas as pd

df = pd.read_csv('data.csv')

newdf = df.fillna(222222)
 
Using fillna() funtion we can fill missing values in a Pandas DataFrame with a specific value

In [ ]:
Q9. How do you concatenate two Pandas DataFrames?

In [ ]:
using concat() function we can concatenate two Pandas DataFrames
syntax:
    pd.concat(dataframe1,dataframe2)

Q10. How do you merge two Pandas DataFrames on a specific column?

In [ ]:
# using merge() funtion we can merge two dataframes

# importing modules
import pandas as pd
  
# creating a dataframe
df1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
                    'Marks':[80, 90, 75, 88, 59]})
  
# creating another dataframe with different data
df2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ],
                    'Gender':['Male', 'Female', 'Female', 'Female']})
# display df1
display(df1)
  
# display df2
display(df2)
# applying merge
df1.merge(df2[['Name', 'Grade', 'Rank']])

Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [ ]:
using groupby() funtion and by using count() or sum() funtion 
syntax :
    dataframe.groupby(index_name).count()
    dataframe.groupby(index_name).sum()
# to specific columns
 dataframe.groupby()[column_name].sum()

Q12. How do you pivot a Pandas DataFrame?

The pivot() function is used to reshaped a given DataFrame organized by given
index / column values. This function does not support data aggregation,
multiple values will result in a MultiIndex in the columns.

DataFrame.pivot(self, index=None, columns=None, values=None)

In [33]:
import pandas as pd
df = pd.DataFrame({'fff': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bbb': ['P', 'Q', 'R', 'P', 'Q', 'R'],
                   'baa': [2, 3, 4, 5, 6, 7],
                   'zzz': ['h', 'i', 'j', 'k', 'l', 'm']})
df
df.pivot(index='fff', columns='bbb', values='baa')

bbb  P  Q  R
fff
one  2  3  4
two  5  6  7

Q13. How do you change the data type of a column in a Pandas DataFrame?

Change column type in pandas using dictionary and DataFrame.astype()

In [34]:
import pandas as pd
 
# sample dataframe
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})
 
# using dictionary to convert specific columns
d = {'A': int,
                'C': float
                }
 
df = df.astype(d)
print(df.dtypes)

A      int32
B     object
C    float64
dtype: object

Change column type in pandas using DataFrame.apply()

In [35]:
# importing pandas as pd
import pandas as pd

df7 = pd.DataFrame({
    'A': [1, 2, 3, '4', '5'],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '2.1', 3.0, '4.1', '5.1']})

# using apply method
df7[['A', 'C']] = df7[['A', 'C']].apply(pd.to_numeric)
print(df7.dtypes)

A      int64
B     object
C    float64
dtype: object

Q14. How do you sort a Pandas DataFrame by a specific column?

In [ ]:
To sort the DataFrame based on the values in a single column, we'll use .
sort_values(). By default, this will return a new DataFrame sorted in
ascending order. It does not modify the original DataFrame.

df.sort_values(column_name)

Q15. How do you create a copy of a Pandas DataFrame?

In [ ]:
The copy() method returns a copy of the DataFrame.
newdf=olddf.copy()

Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

df[df['Name'].str.startswith("S") & df['Age']>25]['Name']

Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [ ]:
df[column_name].mean()

To get column average or mean from pandas DataFrame use either mean() and describe() method.
The DataFrame. mean() method is used to return the mean of the value for the requested axis.

Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

In [ ]:
Standard deviation is calculated using the function . std() . However, 
the Pandas library creates the Dataframe object and then the function .
std() is applied on that Dataframe 

df[column_name].std()

In [ ]:
Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [ ]:
By using corr() function we can get the correlation between two columns in the dataframe.

Syntax: dataframe['first_column'].corr(dataframe['second_column'])

In [ ]:
Q20. How do you select specific columns in a DataFrame using their labels?

In [ ]:
syntax:
    
df[[column_name1,column_name2,..]] or df[specific column names]

In [ ]:
Q21. How do you select specific rows in a DataFrame using their indexes ?

df.loc[index]
or
df.iloc[default_index]

In [ ]:
Q22. How do you sort a DataFrame by a specific column?

df.sort_values(column_name)

In [ ]:
Q23. How do you create a new column in a DataFrame based on the values of another column?

we can add/append a new column to the DataFrame based on the values of another
column using df.assign(), df.apply(), and, np.where() functionand return a
new Dataframe after adding a new column.

df[new_column]=df[df[column_name] condition]

In [37]:
example:
    
data = {
    "name": ["John", "Ted", "Dev", "Brad", "Rex", "Smith", "Samuel", "David"],
    "salary": [10000, 20000, 50000, 45500, 19800, 95000, 5000, 50000]
}
# create dataframe from data dictionary
df = pd.DataFrame(data)
# print the dataframe
display(df.head())

def salary_stats(value):
    if value < 10000:
        return "very low"
    if 10000 <= value < 25000:
        return "low"
    elif 25000 <= value < 40000:
        return "average"
    elif 40000 <= value < 50000:
        return "better"
    elif value >= 50000:
        return "very good"

df['salary_stats'] = df['salary'].map(salary_stats)
display(df.head())

   name  salary
0  John   10000
1   Ted   20000
2   Dev   50000
3  Brad   45500
4   Rex   19800

   name  salary salary_stats
0  John   10000          low
1   Ted   20000          low
2   Dev   50000    very good
3  Brad   45500       better
4   Rex   19800          low

In [ ]:
Q24. How do you remove duplicates from a DataFrame?

In [ ]:
The drop_duplicates() method removes duplicate rows
syntax:
    dataframe.drop_duplicates(subset, keep, inplace, ignore_index)
    
import pandas as pd

data = {
  "name": ["Sally", "Mary", "John", "Mary"],
  "age": [50, 40, 30, 40],
  "qualified": [True, False, False, False]
}

df = pd.DataFrame(data)

newdf = df.drop_duplicates()

In [ ]:
Q25. What is the difference between .loc and .iloc in Pandas?

Both are used to select specific rows in a DataFrame using their indexes
where  loc takes   index_name of dataframe ,
where iloc takes default index of dataframe
syntax:
        
df.loc[index]

df.iloc[default_index]